# Задачи на циклы и оператор условия------
# ----------------------------------------

'''
# Задача 1
# Вывести на экран циклом пять строк из нулей, причем каждая строка должна быть пронумерована.
for i in range(1,6):
    print(i, '0000')
'''

'''
# Задача 2
# Пользователь в цикле вводит 10 цифр. Найти количество введеных пользователем цифр 5.
q = 0
for i in range(10):
    a = int(input('Ведите цифру: '))
    if a == 5:
        q += 1
print('цифра 5 введена', q, 'раз(а)')
'''

'''
# Задача 3
# Найти сумму ряда чисел от 1 до 100. Полученный результат вывести на экран.

sum = 0
for i in range(1,101):
    sum+=i
print(sum)
'''

'''
# Задача 4
# Найти произведение ряда чисел от 1 до 10. Полученный результат вывести на экран.
pro = 1
for i in range(1,11):
    pro = pro * i
print(pro)
'''

'''
# Задача 5
# Вывести цифры числа на каждой строчке.

integer_number = 2129

#print(integer_number%10,integer_number//10)

while integer_number>0:
    print(integer_number%10)
    integer_number = integer_number//10
'''

'''
# Задача 6
# Найти сумму цифр числа.
n = 54386
s = 0
while n > 0:
    s = s + n % 10
    n = n // 10
print(s)
'''

'''
# Задача 7
# Найти произведение цифр числа.
n = 54386
pro = 1
while n > 0:
    pro = pro * (n % 10)
    n = n // 10
print(pro)
'''

'''
# Задача 8
# Дать ответ на вопрос: есть ли среди цифр числа 5?

integer_number = 213413
while integer_number > 0:
    if integer_number % 10 == 5:
        print('Yes')
        break
    integer_number = integer_number // 10
else:
    print('No')
'''

'''
# Задача 9
# Найти максимальную цифру в числе
n = 54386
ma = 0
while n > 0:
    ma = n % 10 if n % 10 > ma else ma
    n = n // 10
print(ma)
'''

'''
# Задача 10
# Найти количество цифр 5 в числе
n = 54386
q = 0
while n > 0:
    q = q + 1 if n % 10 == 5 else q
    n = n // 10
print(q)
'''